---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricWireItem Properties
FabricWireItem Class See Also Send Feedback
---

The FabricWireItem type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Distance | Distance to the next fabric wire item Can be 0 to be used with offset along wire. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OffsetAlongWire | Offset along wire direction Wire distance should be 0 if we want to be along the same wire |
|  | WireLength | Wire length for this wire item |
|  | WireType | The wire type of this wire item |

# See Also

FabricWireItem Class

Autodesk.Revit.DB.Structure Namespace